<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"671032705d00871d56f1da2b92dc11d12e8b4bef1dc32f93a4de9df0116eda12","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #751 at https://github.com/cal-itp/data-infra/actions/runs/18229770106","plan_out_hash":"edc8d2f3aec9efb07a6533e4b03d99bee5b6273c1c634c735616c4cf178c63a7","plan_hash":"f8616cb58c05b3264cda11ad907da6ea7b0069ea16546638af27c2c5de2ced81","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/parse_littlepay_v3/el-dorado-transit.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-composer" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/parse_littlepay_v3/el-dorado-transit.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/parse_littlepay_v3/el-dorado-transit.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer["dags/sync_littlepay_v3/el-dorado-transit.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-composer" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/sync_littlepay_v3/el-dorado-transit.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/sync_littlepay_v3/el-dorado-transit.yml"
+       storage_class  = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #751](https://github.com/cal-itp/data-infra/actions/runs/18229770106)